MillonggSkuyy/brangkas_otomatis_iot/esp32_sidang1/esp32_sidang1.ino
#include "esp_camera.h"
#include <WiFi.h>
#include <WiFiClient.h>
#include <WiFiClientSecure.h>
#include <Preferences.h>
#include <time.h>

#include "soc/soc.h"
#include "soc/rtc_cntl_reg.h"

// ============================================================
// 1) CONFIG
// ============================================================

// ===== PIN CACHE (NVS) =====
Preferences prefs;
static char cachedPin[5] = "1234";

static bool is4DigitPin(const String& s){
  if (s.length() != 4) return false;
  for (int i=0;i<4;i++) if (!isDigit(s[i])) return false;
  return true;
}

static void loadPinCache(){
  prefs.begin("brankas", false);
  String p = prefs.getString("pin", "1234");
  if (!is4DigitPin(p)) p = "2580";
  cachedPin[0]=p[0]; cachedPin[1]=p[1]; cachedPin[2]=p[2]; cachedPin[3]=p[3]; cachedPin[4]='\0';
}

static void savePinCache(const String& p){
  if (!is4DigitPin(p)) return;
  cachedPin[0]=p[0]; cachedPin[1]=p[1]; cachedPin[2]=p[2]; cachedPin[3]=p[3]; cachedPin[4]='\0';
  prefs.putString("pin", p);
}

// ========= WIFI =========
static const char* WIFI_SSID     = "haruru";
static const char* WIFI_PASSWORD = "widd1104";

// ========= TELEGRAM =========
static const char* BOT_TOKEN = "8220630899:AAGiyIMb83mmGMM1edeLHf89mKBhCazeNmk";
static const char* CHAT_ID   = "935724657";

// ========= WEBSITE =========
static const char* WEB_HOST = "webmonitoringbrangkas.dipalji.com";
static const int   WEB_PORT = 443;
static const char* WEB_API_PATH = "/api/akses_brangkas.php";

// ========= WEB AUTH =========
static const char* WEB_API_FIELD = "api_key";
static const char* WEB_API_KEY   = "MYBRANKAS_KEY_12345";

// ========= PIN API =========
static const char* WEB_GET_PIN_PATH    = "/api/get_pin.php";
static const char* WEB_UPDATE_PIN_PATH = "/api/update_pin.php";

// ========= TIMEZONE (WITA GMT+8) =========
static const char* NTP_SERVER = "pool.ntp.org";
static const long  GMT_OFFSET_SEC = 8 * 3600;
static const int   DAYLIGHT_OFFSET_SEC = 0;

static String lastEventKey = "NONE";
static uint32_t lastEventMs = 0;

static long tg_last_update_id = 0;
static uint32_t tg_last_poll_ms = 0;

// ========= TRIGGER INPUT =========
#define TRIG_PIN 13
static const bool TRIG_ACTIVE_LOW = true;  // relay ON -> LOW

// ========= AI Thinker pins =========
#define PWDN_GPIO_NUM     32
#define RESET_GPIO_NUM    -1
#define XCLK_GPIO_NUM      0
#define SIOD_GPIO_NUM     26
#define SIOC_GPIO_NUM     27
#define FLASH_GPIO_NUM     4

#define Y9_GPIO_NUM       35
#define Y8_GPIO_NUM       34
#define Y7_GPIO_NUM       39
#define Y6_GPIO_NUM       36
#define Y5_GPIO_NUM       21
#define Y4_GPIO_NUM       19
#define Y3_GPIO_NUM       18
#define Y2_GPIO_NUM        5
#define VSYNC_GPIO_NUM    25
#define HREF_GPIO_NUM     23
#define PCLK_GPIO_NUM     22

// ========= CAMERA SETTINGS =========
static framesize_t CAM_FRAMESIZE = FRAMESIZE_QVGA;
static int CAM_JPEG_QUALITY = 12;

// ========= VIDEO SETTINGS =========
static const uint32_t MAX_AVI_BYTES = 3 * 1024 * 1024;
static const int FPS = 3;
static const int SECONDS = 5;
static const int MAX_FRAMES = FPS * SECONDS;

// ============================================================
// 2) PULSE DECODER (RELAY FRIENDLY + BOOT GUARD)
//  - Hitung pulse hanya jika durasi ON valid (buang bounce relay)
//  - Burst selesai jika idle > BURST_GAP_US
//  - BOOT_IGNORE + ARM jika TRIG idle stabil (anti event salah saat boot)
// ============================================================

// --- decoder params (cocok Arduino: ON 100ms / OFF 90ms / GAP 650ms)
static const uint32_t DEBOUNCE_US        = 50000;   // 50ms (dari 30ms)
static const uint32_t MIN_ON_US          = 80000;   // 80ms (dari 55ms)
static const uint32_t MAX_ON_US          = 180000;  // 180ms (boleh tetap 200ms)
static const uint32_t BURST_GAP_US       = 500000;  // 500ms (dari 450ms)
static const uint32_t MAX_BURST_TIME_US  = 6000000; // 6s

static inline bool trigIsActiveLevel(int v) {
  return TRIG_ACTIVE_LOW ? (v == LOW) : (v == HIGH);
}

static int stableReadTrig() {
  int a = digitalRead(TRIG_PIN);
  delayMicroseconds(200);
  int b = digitalRead(TRIG_PIN);
  return (a == b) ? a : b;
}

// decoder state
static uint16_t pulseCount = 0;
static uint32_t lastEdgeUs = 0;
static uint32_t burstStartUs = 0;

static int lastStable = HIGH;
static uint32_t lastChangeUs = 0;

static bool inActive = false;
static uint32_t activeStartUs = 0;

// ===== BOOT GUARD =====
static const uint32_t BOOT_IGNORE_MS = 1500;     // abaikan 3.5 detik awal setelah boot
static bool decoderArmed = false;
static uint32_t bootAtMs = 0;
static uint32_t idleStableStartUs = 0;
static const uint32_t IDLE_STABLE_US = 900000;  // harus idle stabil 0.9 detik

static void resetDecoderState(uint32_t nowUs, int stableNow) {
  pulseCount = 0;
  lastEdgeUs = 0;
  burstStartUs = 0;
  inActive = false;
  activeStartUs = 0;
  lastStable = stableNow;
  lastChangeUs = nowUs;
}

// ============================================================
// 3) EVENT MAPPING FINAL (2..11)
// ============================================================
static bool isValidPulse(int p) {
  return (p >= 2 && p <= 11);
}

static String eventKeyFromPulse(int p) {
  switch (p) {
    case 2:  return "PIN_BENAR";
    case 3:  return "PIN_SALAH_1";
    case 4:  return "PIN_SALAH_2";
    case 5:  return "PIN_SALAH_3";
    case 6:  return "PINTU_TERTUTUP";
    case 7:  return "MOVE_MODE_ON";
    case 8:  return "MOVE_MODE_OFF";
    case 9:  return "GETARAN_RINGAN";
    case 10: return "GETARAN_KUAT";
    case 11: return "PEMBUKAAN_PAKSA";
    default: return "UNKNOWN";
  }
}

static bool needVideo(const String& key) {
  return (key == "PIN_SALAH_3" || key == "GETARAN_KUAT" || key == "PEMBUKAAN_PAKSA");
}

static bool isSuspicious(const String& key) {
  return (key == "PIN_SALAH_1" || key == "PIN_SALAH_2" || key == "PIN_SALAH_3" ||
          key == "GETARAN_RINGAN" || key == "GETARAN_KUAT" || key == "PEMBUKAAN_PAKSA");
}

static String getTimeString() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo)) return "Waktu tidak tersedia";
  char buf[20];
  strftime(buf, sizeof(buf), "%d-%m-%Y %H:%M:%S", &timeinfo);
  return String(buf);
}

static String makeStatusText() {
  String s;
  s += "📶 WiFi: ";
  s += (WiFi.status() == WL_CONNECTED) ? "CONNECTED\n" : "DISCONNECTED\n";
  s += "📷 Camera: READY (cek init log)\n";
  s += "🔐 PIN cache: ";
  s += String(cachedPin) + "\n";
  s += "⏱️ Uptime: ";
  s += String(millis() / 1000) + " detik\n";
  s += "🧾 Last event: ";
  s += lastEventKey;
  if (lastEventMs > 0) s += " (" + String((millis() - lastEventMs) / 1000) + " dtk lalu)";
  s += "\n";
  s += "🧷 Decoder: ";
  s += decoderArmed ? "ARMED\n" : "WAITING\n";
  return s;
}

static String makeCaption(const String& key) {
  String cap;
  cap += isSuspicious(key) ? "⚠️ WASPADA! " : "ℹ️ INFO: ";

  if      (key == "PIN_BENAR")         cap += "PIN benar. Brankas UNLOCK (akses sah).";
  else if (key == "PIN_SALAH_1")       cap += "Percobaan PIN salah (ke-1).";
  else if (key == "PIN_SALAH_2")       cap += "Percobaan PIN salah (ke-2).";
  else if (key == "PIN_SALAH_3")       cap += "ALARM! PIN salah 3 kali.";
  else if (key == "PINTU_TERTUTUP")    cap += "Pintu brankas tertutup.";
  else if (key == "MOVE_MODE_ON")      cap += "Move Mode AKTIF (brankas dipindahkan).";
  else if (key == "MOVE_MODE_OFF")     cap += "Move Mode NONAKTIF.";
  else if (key == "GETARAN_RINGAN")    cap += "Terdeteksi getaran (foto saja).";
  else if (key == "GETARAN_KUAT")      cap += "Terdeteksi GETARAN KUAT (tamper/pencurian)!";
  else if (key == "PEMBUKAAN_PAKSA")   cap += "ALARM! Brankas dibuka secara paksa.";
  else                                 cap += "Aktivitas tidak dikenal.";

  cap += "\n\n📍Brankas Pintar\n";
  cap += "⏰ " + getTimeString() + " WITA";
  return cap;
}

