MillonggSkuyy/brangkas_otomatis_iot/esp32_sidang1/esp32_sidang1.ino
// ============================================================
// 4) TELEGRAM HELPERS
// ============================================================
static String readAllTLS(WiFiClientSecure &client, uint32_t timeoutMs = 20000) {
  String resp;
  uint32_t start = millis();
  while (millis() - start < timeoutMs) {
    while (client.available()) resp += (char)client.read();
    if (!client.connected()) break;
    delay(5);
  }
  return resp;
}

static bool telegramSendMultipart(
  const char* apiMethod,
  const uint8_t* data, uint32_t len,
  const char* fieldName,
  const char* filename,
  const char* contentType,
  const String& captionText
) {
  WiFiClientSecure client;
  client.setInsecure();
  client.setTimeout(90);

  const char* host = "api.telegram.org";
  String url = "/bot" + String(BOT_TOKEN) + "/" + String(apiMethod);
  String boundary = "----ESP32BoundaryTG";

  String head =
    "--" + boundary + "\r\n"
    "Content-Disposition: form-data; name=\"chat_id\"\r\n\r\n" +
    String(CHAT_ID) + "\r\n";

  if (captionText.length() > 0) {
    head +=
      "--" + boundary + "\r\n"
      "Content-Disposition: form-data; name=\"caption\"\r\n\r\n" +
      captionText + "\r\n";
  }

  head +=
    "--" + boundary + "\r\n"
    "Content-Disposition: form-data; name=\"" + String(fieldName) + "\"; filename=\"" + String(filename) + "\"\r\n"
    "Content-Type: " + String(contentType) + "\r\n\r\n";

  String tail = "\r\n--" + boundary + "--\r\n";
  uint32_t totalLen = head.length() + len + tail.length();

  if (!client.connect(host, 443)) return false;

  client.print(String("POST ") + url + " HTTP/1.1\r\n");
  client.print(String("Host: ") + host + "\r\n");
  client.print("User-Agent: ESP32CAM\r\n");
  client.print("Content-Type: multipart/form-data; boundary=" + boundary + "\r\n");
  client.print("Content-Length: " + String(totalLen) + "\r\n");
  client.print("Connection: close\r\n\r\n");

  client.print(head);

  const size_t chunk = 2048;
  for (size_t i = 0; i < len; i += chunk) {
    size_t n = (len - i >= chunk) ? chunk : (len - i);
    if (client.write(data + i, n) != n) { client.stop(); return false; }
    delay(0);
  }

  client.print(tail);

  String resp = readAllTLS(client, 12000);
  client.stop();
  return resp.indexOf("\"ok\":true") >= 0;
}

static bool telegramSendPhoto(const uint8_t* data, uint32_t len, const String& caption) {
  return telegramSendMultipart("sendPhoto", data, len, "photo", "photo.jpg", "image/jpeg", caption);
}

static bool telegramSendAviAsDocument(const uint8_t* data, uint32_t len, const String& caption) {
  return telegramSendMultipart("sendDocument", data, len, "document", "video_5s.avi", "video/x-msvideo", caption);
}

static bool telegramSendMessage(const String& text) {
  WiFiClientSecure client;
  client.setInsecure();
  client.setTimeout(20);

  const char* host = "api.telegram.org";
  String url = "/bot" + String(BOT_TOKEN) + "/sendMessage";
  String postData = "chat_id=" + String(CHAT_ID) + "&text=" + text;

  if (!client.connect(host, 443)) return false;

  client.print(String("POST ") + url + " HTTP/1.1\r\n");
  client.print(String("Host: ") + host + "\r\n");
  client.print("User-Agent: ESP32CAM\r\n");
  client.print("Content-Type: application/x-www-form-urlencoded\r\n");
  client.print("Connection: close\r\n");
  client.print("Content-Length: " + String(postData.length()) + "\r\n\r\n");
  client.print(postData);

  String resp = readAllTLS(client, 12000);
  client.stop();
  return resp.indexOf("\"ok\":true") >= 0;
}

static String telegramGetUpdates(long offset) {
  WiFiClientSecure client;
  client.setInsecure();
  client.setTimeout(4);

  const char* host = "api.telegram.org";
  String url = "/bot" + String(BOT_TOKEN) + "/getUpdates?timeout=0&offset=" + String(offset);

  if (!client.connect(host, 443)) return "";

  client.print(String("GET ") + url + " HTTP/1.1\r\n");
  client.print(String("Host: ") + host + "\r\n");
  client.print("User-Agent: ESP32CAM\r\n");
  client.print("Connection: close\r\n\r\n");

  String resp = readAllTLS(client, 2500);
  client.stop();

  int idx = resp.indexOf("\r\n\r\n");
  if (idx >= 0) resp = resp.substring(idx + 4);
  return resp;
}

static void handleTelegramCommand(const String& cmd);

static void telegramService() {
  if (WiFi.status() != WL_CONNECTED) return;
  if (millis() - tg_last_poll_ms < 5000) return;
  tg_last_poll_ms = millis();

  String body = telegramGetUpdates(tg_last_update_id + 1);
  if (body.length() == 0) return;

  int p = 0;
  while (true) {
    int u = body.indexOf("\"update_id\":", p);
    if (u < 0) break;
    u += 12;
    while (u < (int)body.length() && body[u] == ' ') u++;
    int e = u;
    while (e < (int)body.length() && isDigit(body[e])) e++;
    long upd = body.substring(u, e).toInt();
    if (upd > tg_last_update_id) tg_last_update_id = upd;

    int t = body.indexOf("\"text\":\"", e);
    if (t > 0) {
      t += 8;
      int te = body.indexOf("\"", t);
      if (te > t) {
        String txt = body.substring(t, te);
        txt.replace("\\/", "/");
        txt.replace("\\n", "\n");
        txt.trim();
        handleTelegramCommand(txt);
      }
    }
    p = e;
  }
}

// ============================================================
// 4B) WEB HELPERS
// ============================================================
static String readAllHTTP(WiFiClient &client, uint32_t timeoutMs = 15000) {
  String resp;
  uint32_t start = millis();
  while (millis() - start < timeoutMs) {
    while (client.available()) resp += (char)client.read();
    if (!client.connected()) break;
    delay(2);
  }
  return resp;
}

static int httpStatusCode(const String& resp) {
  int p = resp.indexOf("HTTP/");
  if (p < 0) return -1;
  int sp = resp.indexOf(' ', p);
  if (sp < 0 || sp + 4 > (int)resp.length()) return -1;
  return resp.substring(sp + 1, sp + 4).toInt();
}

static String httpBodyOnly(const String& resp) {
  int idx = resp.indexOf("\r\n\r\n");
  if (idx < 0) return resp;
  return resp.substring(idx + 4);
}

