MillonggSkuyy/brangkas_otomatis_iot/esp32_sidang1/esp32_sidang1.ino
static int jsonGetIntField(const String& body, const char* key) {
  String k = String("\"") + key + "\"";
  int p = body.indexOf(k);
  if (p < 0) return 0;
  p = body.indexOf(':', p);
  if (p < 0) return 0;
  p++;
  while (p < (int)body.length() && (body[p] == ' ' || body[p] == '\n' || body[p] == '\r' || body[p] == '\t')) p++;
  int e = p;
  while (e < (int)body.length() && isDigit(body[e])) e++;
  return body.substring(p, e).toInt();
}

// ============================================================
// 4C) PIN API (GET/UPDATE)
// ============================================================
static bool webGetPin(String &outPin) {
  WiFiClientSecure client;
  client.setInsecure(); // agar tidak perlu sertifikat
  client.setTimeout(15);


  String url = String(WEB_GET_PIN_PATH) + "?" + WEB_API_FIELD + "=" + WEB_API_KEY;
  if (!client.connect(WEB_HOST, WEB_PORT)) return false;

  client.print(String("GET ") + url + " HTTP/1.1\r\n");
  client.print(String("Host: ") + WEB_HOST + "\r\n");
  client.print("User-Agent: ESP32CAM\r\n");
  client.print("Connection: close\r\n\r\n");

  String resp = readAllHTTP(client, 15000);
  client.stop();

  if (httpStatusCode(resp) != 200) return false;
  String body = httpBodyOnly(resp);

  int p = body.indexOf("\"pin\"");
  if (p < 0) p = body.indexOf("\"pin_brangkas\"");
  if (p < 0) return false;

  p = body.indexOf(':', p);
  if (p < 0) return false;
  p++;

  while (p < (int)body.length() && (body[p] == ' ' || body[p] == '\"')) p++;
  int e = p;
  while (e < (int)body.length() && isDigit(body[e])) e++;

  String pin = body.substring(p, e);
  pin.trim();
  if (pin.length() != 4) return false;

  outPin = pin;
  return true;
}

static bool webUpdatePin(const String& oldPin, const String& newPin) {
  WiFiClientSecure client;
  client.setInsecure(); // agar tidak perlu sertifikat
  client.setTimeout(15);

  if (!client.connect(WEB_HOST, WEB_PORT)) return false;

  String postData =
    String(WEB_API_FIELD) + "=" + WEB_API_KEY +
    "&pin_lama=" + oldPin +
    "&pin_baru=" + newPin;

  client.print(String("POST ") + WEB_UPDATE_PIN_PATH + " HTTP/1.1\r\n");
  client.print(String("Host: ") + WEB_HOST + "\r\n");
  client.print("User-Agent: ESP32CAM\r\n");
  client.print("Content-Type: application/x-www-form-urlencoded\r\n");
  client.print("Connection: close\r\n");
  client.print("Content-Length: " + String(postData.length()) + "\r\n\r\n");
  client.print(postData);

  String resp = readAllHTTP(client, 15000);
  client.stop();

  if (httpStatusCode(resp) != 200) return false;
  return resp.indexOf("\"ok\":true") >= 0;
}

// ============================================================
// 5) AVI BUILD (MJPG -> AVI)
// ============================================================
struct FrameInfo { uint32_t offset; uint32_t size; };
static uint8_t* aviBuf = nullptr;
static uint32_t aviLen = 0;
static FrameInfo frames[MAX_FRAMES];
static int frameCount = 0;

static void write32(uint8_t* p, uint32_t v) {
  p[0] = (uint8_t)(v & 0xFF);
  p[1] = (uint8_t)((v >> 8) & 0xFF);
  p[2] = (uint8_t)((v >> 16) & 0xFF);
  p[3] = (uint8_t)((v >> 24) & 0xFF);
}

static void memWrite(const void* data, uint32_t n) {
  if (!aviBuf) return;
  if (aviLen + n > MAX_AVI_BYTES) return;
  memcpy(aviBuf + aviLen, data, n);
  aviLen += n;
}
static void memWrite4(const char* s4) { memWrite(s4, 4); }

static void memPad2() {
  if (aviLen & 1) { uint8_t z = 0; memWrite(&z, 1); }
}

static uint32_t memWriteSizePlaceholder() {
  uint32_t pos = aviLen;
  uint32_t zero = 0;
  memWrite(&zero, 4);
  return pos;
}

static void patchSizeAt(uint32_t pos, uint32_t size) {
  if (!aviBuf) return;
  write32(aviBuf + pos, size);
}

static void getWH(uint32_t &w, uint32_t &h) {
  if (CAM_FRAMESIZE == FRAMESIZE_QVGA) { w = 320; h = 240; return; }
  if (CAM_FRAMESIZE == FRAMESIZE_VGA)  { w = 640; h = 480; return; }
  w = 160; h = 120;
}

static inline void flashOn()  { digitalWrite(FLASH_GPIO_NUM, HIGH); }
static inline void flashOff() { digitalWrite(FLASH_GPIO_NUM, LOW);  }

static bool buildAvi(int fps = FPS, int seconds = SECONDS) {
  frameCount = 0;
  aviLen = 0;

  if (!aviBuf) {
    aviBuf = (uint8_t*)ps_malloc(MAX_AVI_BYTES);
    if (!aviBuf) return false;
  }

  for (int i = 0; i < 2; i++) {
    camera_fb_t* t = esp_camera_fb_get();
    if (t) esp_camera_fb_return(t);
    delay(40);
  }

  const int targetFrames = min(MAX_FRAMES, fps * seconds);
  uint32_t width, height;
  getWH(width, height);

  memWrite4("RIFF");
  uint32_t riffSizePos = memWriteSizePlaceholder();
  memWrite4("AVI ");

  memWrite4("LIST");
  uint32_t hdrlSizePos = memWriteSizePlaceholder();
  memWrite4("hdrl");

  memWrite4("avih");
  uint32_t avihSize = 56;
  memWrite(&avihSize, 4);

  uint32_t usPerFrame = 1000000UL / (uint32_t)fps;
  uint32_t flags = 0x10;

  uint8_t avih[56] = {0};
  write32(avih + 0,  usPerFrame);
  write32(avih + 12, flags);
  write32(avih + 16, (uint32_t)targetFrames);
  write32(avih + 24, 1);
  write32(avih + 32, width);
  write32(avih + 36, height);
  memWrite(avih, 56);

  memWrite4("LIST");
  uint32_t strlSizePos = memWriteSizePlaceholder();
  memWrite4("strl");

  memWrite4("strh");
  uint32_t strhSize = 56;
  memWrite(&strhSize, 4);

  uint8_t strh[56] = {0};
  memcpy(strh + 0, "vids", 4);
  memcpy(strh + 4, "MJPG", 4);
  write32(strh + 20, 1);
  write32(strh + 24, (uint32_t)fps);
  write32(strh + 32, (uint32_t)targetFrames);
  memWrite(strh, 56);

  memWrite4("strf");
  uint32_t strfSize = 40;
  memWrite(&strfSize, 4);

  uint8_t strf[40] = {0};
  write32(strf + 0, 40);
  write32(strf + 4, width);
  write32(strf + 8, height);
  strf[12] = 1;
  strf[14] = 24;
  memcpy(strf + 16, "MJPG", 4);
  memWrite(strf, 40);

  patchSizeAt(strlSizePos, (aviLen - (strlSizePos + 4)));
  patchSizeAt(hdrlSizePos, (aviLen - (hdrlSizePos + 4)));

  memWrite4("LIST");
  uint32_t moviSizePos = memWriteSizePlaceholder();
  memWrite4("movi");
  uint32_t moviDataStart = aviLen;

  for (int i = 0; i < targetFrames; i++) {
    flashOn();
    delay(15);
    camera_fb_t* fb = esp_camera_fb_get();
    flashOff();
    if (!fb) break;

    memWrite4("00dc");
    uint32_t sz = fb->len;
    memWrite(&sz, 4);

    frames[frameCount].offset = aviLen;
    frames[frameCount].size   = sz;

    memWrite(fb->buf, fb->len);
    memPad2();
    frameCount++;

