MillonggSkuyy/brangkas_otomatis_iot/esp32_sidang1/esp32_sidang1.ino
    esp_camera_fb_return(fb);

    delay(1000 / fps);
    if (aviLen > (MAX_AVI_BYTES - 80000)) break;
  }

  patchSizeAt(moviSizePos, (aviLen - (moviSizePos + 4)));

  memWrite4("idx1");
  uint32_t idxSizePos = memWriteSizePlaceholder();
  uint32_t idxStart = aviLen;

  for (int i = 0; i < frameCount; i++) {
    memWrite4("00dc");
    uint32_t kf = 0x10;
    memWrite(&kf, 4);
    uint32_t offset = frames[i].offset - moviDataStart;
    memWrite(&offset, 4);
    uint32_t sz = frames[i].size;
    memWrite(&sz, 4);
  }

  patchSizeAt(idxSizePos, (aviLen - idxStart));
  patchSizeAt(riffSizePos, aviLen - 8);

  return frameCount > 0;
}

// ============================================================
// 6) WEB UPLOAD (photo_only/video_only)
// ============================================================
static int webUploadPhotoOnlyReturnId(const uint8_t* photoData, uint32_t photoLen, const char* aktivitasText) {
  WiFiClientSecure client;
  client.setInsecure(); // agar tidak perlu sertifikat
  client.setTimeout(30);


  String boundary = "----ESP32BoundaryWEB_PHOTO";

  String part1 =
    "--" + boundary + "\r\n"
    "Content-Disposition: form-data; name=\"" + String(WEB_API_FIELD) + "\"\r\n\r\n" +
    String(WEB_API_KEY) + "\r\n"
    "--" + boundary + "\r\n"
    "Content-Disposition: form-data; name=\"mode\"\r\n\r\n"
    "photo_only\r\n"
    "--" + boundary + "\r\n"
    "Content-Disposition: form-data; name=\"aktivitas\"\r\n\r\n" +
    String(aktivitasText) + "\r\n"
    "--" + boundary + "\r\n"
    "Content-Disposition: form-data; name=\"photo\"; filename=\"photo.jpg\"\r\n"
    "Content-Type: image/jpeg\r\n\r\n";

  String tail = "\r\n--" + boundary + "--\r\n";
  uint32_t totalLen = part1.length() + photoLen + tail.length();

  if (!client.connect(WEB_HOST, WEB_PORT)) return 0;

  client.print(String("POST ") + WEB_API_PATH + " HTTP/1.1\r\n");
  client.print(String("Host: ") + WEB_HOST + "\r\n");
  client.print("User-Agent: ESP32CAM\r\n");
  client.print("Connection: close\r\n");
  client.print("Content-Type: multipart/form-data; boundary=" + boundary + "\r\n");
  client.print("Content-Length: " + String(totalLen) + "\r\n\r\n");

  client.print(part1);

  const size_t chunk = 1024;
  for (size_t i = 0; i < photoLen; i += chunk) {
    size_t n = (photoLen - i >= chunk) ? chunk : (photoLen - i);
    if (client.write(photoData + i, n) != n) { client.stop(); return 0; }
    delay(0);
  }

  client.print(tail);

  String resp = readAllHTTP(client, 20000);
  client.stop();

  int code = httpStatusCode(resp);
  String body = httpBodyOnly(resp);
  if (code != 200) return 0;

  return jsonGetIntField(body, "id");
}

static bool webUploadVideoOnly(int aksesId, const uint8_t* videoData, uint32_t videoLen) {
  WiFiClientSecure client;;
  client.setInsecure(); // agar tidak perlu sertifikat
  client.setTimeout(30);

  String boundary = "----ESP32BoundaryWEB_VIDEO";

  String part1 =
    "--" + boundary + "\r\n"
    "Content-Disposition: form-data; name=\"" + String(WEB_API_FIELD) + "\"\r\n\r\n" +
    String(WEB_API_KEY) + "\r\n"
    "--" + boundary + "\r\n"
    "Content-Disposition: form-data; name=\"mode\"\r\n\r\n"
    "video_only\r\n"
    "--" + boundary + "\r\n"
    "Content-Disposition: form-data; name=\"akses_id\"\r\n\r\n" +
    String(aksesId) + "\r\n"
    "--" + boundary + "\r\n"
    "Content-Disposition: form-data; name=\"video\"; filename=\"video_5s.avi\"\r\n"
    "Content-Type: video/x-msvideo\r\n\r\n";

  String tail = "\r\n--" + boundary + "--\r\n";
  uint32_t totalLen = part1.length() + videoLen + tail.length();

  if (!client.connect(WEB_HOST, WEB_PORT)) return false;

  client.print(String("POST ") + WEB_API_PATH + " HTTP/1.1\r\n");
  client.print(String("Host: ") + WEB_HOST + "\r\n");
  client.print("User-Agent: ESP32CAM\r\n");
  client.print("Connection: close\r\n");
  client.print("Content-Type: multipart/form-data; boundary=" + boundary + "\r\n");
  client.print("Content-Length: " + String(totalLen) + "\r\n\r\n");

  client.print(part1);

  const size_t chunk = 1024;
  for (size_t i = 0; i < videoLen; i += chunk) {
    size_t n = (videoLen - i >= chunk) ? chunk : (videoLen - i);
    if (client.write(videoData + i, n) != n) { client.stop(); return false; }
    delay(0);
  }

  client.print(tail);

  String resp = readAllHTTP(client, 30000);
  client.stop();

  return (httpStatusCode(resp) == 200);
}

// ============================================================
// 7) CAMERA INIT
// ============================================================
static bool initCamera() {
  camera_config_t config;
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer   = LEDC_TIMER_0;

  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;

  config.pin_xclk  = XCLK_GPIO_NUM;
  config.pin_pclk  = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href  = HREF_GPIO_NUM;

#if ESP_IDF_VERSION_MAJOR >= 4
  config.pin_sscb_sda = SIOD_GPIO_NUM;
  config.pin_sscb_scl = SIOC_GPIO_NUM;
#else
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
#endif

  config.pin_pwdn  = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;

  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;
  config.frame_size   = CAM_FRAMESIZE;
  config.jpeg_quality = CAM_JPEG_QUALITY;
  config.grab_mode    = CAMERA_GRAB_LATEST;

  if (psramFound()) {
    config.fb_count = 2;
    config.fb_location = CAMERA_FB_IN_PSRAM;
  } else {
    config.fb_count = 1;
    config.fb_location = CAMERA_FB_IN_DRAM;
  }

  if (esp_camera_init(&config) != ESP_OK) return false;

  sensor_t* s = esp_camera_sensor_get();
  s->set_framesize(s, CAM_FRAMESIZE);
  s->set_quality(s, CAM_JPEG_QUALITY);
  return true;
}

// ============================================================
// 8) EVENT HANDLER
// ============================================================
static void handleEvent(int pulses) {
  String key = eventKeyFromPulse(pulses);

  lastEventKey = key;
  lastEventMs  = millis();

  String caption = makeCaption(key);
  String captionVid = caption + "\n🎥 Video 5 detik terlampir.";

  flashOn();
  delay(35);
  camera_fb_t* fb = esp_camera_fb_get();
  flashOff();
  if (!fb) return;

  uint32_t photoLen = fb->len;
  uint8_t* photoCopy = (uint8_t*)ps_malloc(photoLen);
  if (!photoCopy) { esp_camera_fb_return(fb); return; }
  memcpy(photoCopy, fb->buf, photoLen);
  esp_camera_fb_return(fb);

  telegramSendPhoto(photoCopy, photoLen, caption);

  int aksesId = webUploadPhotoOnlyReturnId(photoCopy, photoLen, key.c_str());

  if (needVideo(key)) {
    if (buildAvi(FPS, SECONDS)) {
      telegramSendAviAsDocument(aviBuf, aviLen, captionVid);
      if (aksesId > 0) webUploadVideoOnly(aksesId, aviBuf, aviLen);
    }
  }

  free(photoCopy);
}

