MillonggSkuyy/brangkas_otomatis_iot/esp32_sidang1/esp32_sidang1.ino
// ============================================================
// 8B) SERIAL COMMAND SERVICE (UNO <-> ESP32)
// ============================================================
static String serialLine = "";

static void serialService() {
  while (Serial.available()) {
    char c = (char)Serial.read();
    if (c == '\r') continue;

    if (c == '\n') {
      String line = serialLine;
      serialLine = "";
      line.trim();
      if (line.length() == 0) return;

      if (line == "GETPIN") {
        String pinWeb;
        if (WiFi.status() == WL_CONNECTED && webGetPin(pinWeb) && is4DigitPin(pinWeb)) {
          savePinCache(pinWeb);
        }
        Serial.print("PIN=");
        Serial.println(cachedPin);
        return;
      }

      if (line.startsWith("SETPIN")) {
        int pOld = line.indexOf("old=");
        int pNew = line.indexOf("new=");
        if (pOld < 0 || pNew < 0) { Serial.println("ERR"); return; }

        String oldPin = line.substring(pOld + 4, pOld + 8);
        String newPin = line.substring(pNew + 4, pNew + 8);
        oldPin.trim(); newPin.trim();

        if (!is4DigitPin(oldPin) || !is4DigitPin(newPin)) { Serial.println("ERR"); return; }
        if (WiFi.status() != WL_CONNECTED) { Serial.println("ERR"); return; }

        if (webUpdatePin(oldPin, newPin)) {
          savePinCache(newPin);
          Serial.println("OK");
        } else {
          Serial.println("ERR");
        }
        return;
      }

      Serial.println("ERR");
      return;
    } else {
      if (serialLine.length() < 80) serialLine += c;
      else serialLine = "";
    }
  }
}

// ============================================================
// TELEGRAM COMMANDS
// ============================================================
static void doManualPhoto(const String& caption) {
  if (WiFi.status() != WL_CONNECTED) {
    telegramSendMessage("❌ WiFi belum connect, tidak bisa kirim foto.");
    return;
  }

  flashOn();
  delay(35);
  camera_fb_t* fb = esp_camera_fb_get();
  flashOff();
  if (!fb) {
    telegramSendMessage("❌ Gagal ambil foto.");
    return;
  }

  telegramSendPhoto(fb->buf, fb->len, caption);
  esp_camera_fb_return(fb);
}

static void doManualVideo(const String& caption) {
  if (WiFi.status() != WL_CONNECTED) {
    telegramSendMessage("❌ WiFi belum connect, tidak bisa kirim video.");
    return;
  }

  telegramSendMessage("⏳ Rekam video 5 detik...");
  if (buildAvi(FPS, SECONDS)) {
    telegramSendAviAsDocument(aviBuf, aviLen, caption);
    telegramSendMessage("✅ Video terkirim");
  } else {
    telegramSendMessage("❌ Gagal rekam video");
  }
}

static void handleTelegramCommand(const String& cmd) {
  if (cmd == "/status") {
    telegramSendMessage(makeStatusText());
    return;
  }
  if (cmd == "/photo") {
    telegramSendMessage("📸 Foto manual");
    doManualPhoto("📸 Foto manual\n\n📍Brankas Pintar");
    telegramSendMessage("✅ Foto terkirim");
    return;
  }
  if (cmd == "/video") {
    doManualVideo("🎥 Video manual 5 detik\n\n📍Brankas Pintar");
    return;
  }
  telegramSendMessage("Perintah dikenal:\n/status\n/photo\n/video");
}

// ============================================================
// 9) SETUP / LOOP
// ============================================================
void setup() {
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0);

  Serial.begin(115200);
  delay(400);

  loadPinCache();

  pinMode(FLASH_GPIO_NUM, OUTPUT);
  flashOff();

  pinMode(TRIG_PIN, INPUT_PULLUP);

  // init boot guard
  bootAtMs = millis();
  decoderArmed = false;
  idleStableStartUs = 0;
  resetDecoderState(micros(), stableReadTrig());

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  unsigned long t = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - t < 25000) delay(250);

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("❌ WiFi gagal connect (PIN CACHE MODE)");
  } else {
    configTime(GMT_OFFSET_SEC, DAYLIGHT_OFFSET_SEC, NTP_SERVER);

    struct tm timeinfo;
    if (!getLocalTime(&timeinfo, 10000)) {
      Serial.println("❌ Gagal sync waktu NTP");
    } else {
      Serial.println("✅ Waktu NTP OK");
    }

    if (!initCamera()) {
      Serial.println("❌ Camera init gagal (PIN CACHE MODE)");
    }
  }

  Serial.println("✅ ESP32-CAM READY");
}

void loop() {
  // serial protocol from UNO
  serialService();

  uint32_t nowUs = micros();

  // ===== BOOT IGNORE =====
  if (millis() - bootAtMs < BOOT_IGNORE_MS) {
    resetDecoderState(nowUs, stableReadTrig());
    delay(2);
    return;
  }

  // ===== ARM only when TRIG idle stable =====
  if (!decoderArmed) {
    int s = stableReadTrig();
    bool active = trigIsActiveLevel(s);

    if (!active) {
      if (idleStableStartUs == 0) idleStableStartUs = nowUs;
      if (nowUs - idleStableStartUs >= IDLE_STABLE_US) {
        decoderArmed = true;
        resetDecoderState(nowUs, s);
        Serial.println("✅ DECODER ARMED");
      }
    } else {
      idleStableStartUs = 0;
    }

    delay(2);
    return;
  }

  // ===== RELAY FRIENDLY DECODER =====
  int raw = stableReadTrig();

  if (raw != lastStable) {
    if (nowUs - lastChangeUs >= DEBOUNCE_US) {
      lastStable = raw;
      lastChangeUs = nowUs;

      bool isActive = trigIsActiveLevel(lastStable);

      if (isActive && !inActive) {
        inActive = true;
        activeStartUs = nowUs;

        if (pulseCount == 0) burstStartUs = nowUs;
        lastEdgeUs = nowUs;
      }

      if (!isActive && inActive) {
        inActive = false;
        uint32_t onDur = nowUs - activeStartUs;

        if (onDur >= MIN_ON_US && onDur <= MAX_ON_US) {
          pulseCount++;
          lastEdgeUs = nowUs;
        }
      }
    }
  }

  if (pulseCount > 0) {
    if ((nowUs - lastEdgeUs) > BURST_GAP_US || (nowUs - burstStartUs) > MAX_BURST_TIME_US) {
      int pulses = (int)pulseCount;

      // reset state before handle
      resetDecoderState(nowUs, stableReadTrig());

      if (isValidPulse(pulses)) {
        Serial.printf("EVENT pulses=%d => %s\n", pulses, eventKeyFromPulse(pulses).c_str());
        handleEvent(pulses);
      } else {
        Serial.printf("IGNORED noise pulses=%d\n", pulses);

        // re-arm singkat anti noise beruntun
        decoderArmed = false;
        idleStableStartUs = 0;
      }
    }
  }

  // Telegram only when idle
  if (pulseCount == 0 && (lastEdgeUs == 0 || (micros() - lastEdgeUs) > 500000UL)) {
    telegramService();
  }

  delay(2);
}
